particle-iot/device-os/hal/src/nRF52840/i2c_hal.cpp
    // Just in case make sure that the pins are correctly configured (they should anyway be at this point)
    hal_gpio_config_t conf = {
        .size = sizeof(conf),
        .version = HAL_GPIO_VERSION,
        .mode = OUTPUT_OPEN_DRAIN_PULLUP,
        .set_value = true,
        .value = 1,
        .drive_strength = HAL_GPIO_DRIVE_DEFAULT
    };
    hal_gpio_configure(i2cMap[i2c].sda_pin, &conf, nullptr);
    conf.value = hal_gpio_read(i2cMap[i2c].scl_pin);
    hal_gpio_configure(i2cMap[i2c].scl_pin, &conf, nullptr);

    // Generate up to 9 pulses on SCL to tell slave to release the bus
    for (int i = 0; i < 9; i++) {
        hal_gpio_write(i2cMap[i2c].sda_pin, 1);
        HAL_Delay_Microseconds(50);

        if (hal_gpio_read(i2cMap[i2c].sda_pin) == 0) {
            hal_gpio_write(i2cMap[i2c].scl_pin, 0);
            HAL_Delay_Microseconds(50);
            hal_gpio_write(i2cMap[i2c].scl_pin, 1);
            HAL_Delay_Microseconds(50);
            hal_gpio_write(i2cMap[i2c].scl_pin, 0);
            HAL_Delay_Microseconds(50);
        } else {
            break;
        }
    }

    // Generate STOP condition: pull SDA low, switch to high
    hal_gpio_write(i2cMap[i2c].sda_pin, 0);
    HAL_Delay_Microseconds(50);
    hal_gpio_write(i2cMap[i2c].scl_pin, 1);
    HAL_Delay_Microseconds(50);
    hal_gpio_write(i2cMap[i2c].sda_pin, 1);
    HAL_Delay_Microseconds(50);

    hal_pin_set_function(i2cMap[i2c].sda_pin, PF_I2C);
    hal_pin_set_function(i2cMap[i2c].scl_pin, PF_I2C);

    hal_i2c_begin(i2c, i2cMap[i2c].mode, i2cMap[i2c].address, nullptr);
    return !hal_i2c_is_enabled(i2c, nullptr);
}

int32_t hal_i2c_lock(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return -1;
    }
    if (!hal_interrupt_is_isr()) {
        os_mutex_recursive_t mutex = i2cMap[i2c].mutex;
        if (mutex) {
            return os_mutex_recursive_lock(mutex);
        }
    }
    return -1;
}

int32_t hal_i2c_unlock(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return -1;
    }
    if (!hal_interrupt_is_isr()) {
        os_mutex_recursive_t mutex = i2cMap[i2c].mutex;
        if (mutex) {
            return os_mutex_recursive_unlock(mutex);
        }
    }
    return -1;
}

int hal_i2c_sleep(hal_i2c_interface_t i2c, bool sleep, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    I2cLock lk(i2c);
    if (sleep) {
        // Suspend I2C
        CHECK_TRUE(i2cMap[i2c].state == HAL_I2C_STATE_ENABLED, SYSTEM_ERROR_INVALID_STATE);
        hal_i2c_end(i2c, nullptr);
        i2cMap[i2c].state = HAL_I2C_STATE_SUSPENDED;
    } else {
        // Restore I2C
        CHECK_TRUE(i2cMap[i2c].state == HAL_I2C_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        hal_i2c_begin(i2c, i2cMap[i2c].mode, i2cMap[i2c].address, nullptr);
    }

    return SYSTEM_ERROR_NONE;
}
